Table of Contents
 Interface IIdeaBoltAssembly
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
public interface IIdeaBoltAssembly : IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 BoreHole
Bore hole
double BoreHole { get; }
Property Value
double
 DiagonalHeadDiameter
Diagonal head diametere
double DiagonalHeadDiameter { get; }
Property Value
double
 Diameter
Diameter
double Diameter { get; }
Property Value
double
 HeadDiameter
Head Diamete
double HeadDiameter { get; }
Property Value
double
 HeadHeight
Head height
double HeadHeight { get; }
Property Value
double
 HoleDiameter
Hole Diameter
double HoleDiameter { get; }
Property Value
double
 Lenght
Lenght of bolt
double Lenght { get; }
Property Value
double
 Material
Material of the plate.
IIdeaMaterial Material { get; }
Property Value
IIdeaMaterial
 NutThickness
Nut thickness
double NutThickness { get; }
Property Value
double
 Standard
Standard
string Standard { get; }
Property Value
string
 TensileStressArea
Tensile Stress Area
double TensileStressArea { get; }
Property Value
double
 Edit this page